docs/manual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-22 Thu 15:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Stargaze user manual</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Stargaze user manual</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org54e84c9">1. Lexical syntax</a>
<ul>
<li><a href="#orgdda54fa">1.1. Comment</a></li>
<li><a href="#org01cf05e">1.2. Booleans</a></li>
<li><a href="#orgbcef08b">1.3. Strings</a></li>
<li><a href="#org129f660">1.4. Characters</a></li>
<li><a href="#org9073797">1.5. Vector</a></li>
</ul>
</li>
<li><a href="#org399c19e">2. Built-in primitives</a>
<ul>
<li><a href="#org7995371">2.1. Module-related</a></li>
<li><a href="#orgd11db39">2.2. Miscellaneous</a></li>
<li><a href="#org5d5e166">2.3. Integer</a></li>
<li><a href="#org4021774">2.4. Floating-point</a></li>
<li><a href="#org83faf2b">2.5. Pair</a></li>
<li><a href="#orge3530bf">2.6. Character</a></li>
<li><a href="#orgc4fe870">2.7. String</a></li>
<li><a href="#orgc05c8ad">2.8. Boolean</a></li>
<li><a href="#org94f8f77">2.9. Symbol</a></li>
<li><a href="#org1bd9999">2.10. List</a></li>
<li><a href="#org8e56296">2.11. Vector</a></li>
<li><a href="#orga53516a">2.12. File input/output</a></li>
<li><a href="#org1704f30">2.13. Iteration</a></li>
</ul>
</li>
<li><a href="#org6e92d60">3. Extended primitives</a>
<ul>
<li><a href="#org53b2ec8">3.1. List libraries</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
(very early draft)
</p>


<div id="outline-container-org54e84c9" class="outline-2">
<h2 id="org54e84c9"><span class="section-number-2">1.</span> Lexical syntax</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgdda54fa" class="outline-3">
<h3 id="orgdda54fa"><span class="section-number-3">1.1.</span> Comment</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Comment in Stargaze starts with <code>;</code>.
</p>
</div>
</div>

<div id="outline-container-org01cf05e" class="outline-3">
<h3 id="org01cf05e"><span class="section-number-3">1.2.</span> Booleans</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Only the strings <code>#t</code> and <code>#f</code> are boolean values; they evaluate to true and false respectively.
</p>
</div>
</div>

<div id="outline-container-orgbcef08b" class="outline-3">
<h3 id="orgbcef08b"><span class="section-number-3">1.3.</span> Strings</h3>
<div class="outline-text-3" id="text-1-3">
<p>
There's only one kind of syntax for string literals: <code>"{string-piece}*"</code>, where <code>string-piece</code> is one of:
</p>

<ul class="org-ul">
<li>Normal characters.</li>
<li>Escape sequences, which starts with <code>\</code> and is of the following format:
<ul class="org-ul">
<li><code>\r</code>, <code>\n</code>, <code>\b</code>, <code>\t</code>, <code>\\</code>, <code>\"</code>, <code>\v</code>, <code>\f</code>, for carriage return, linefeed, backspace, horizontal tab, slash, double quote, vertical tab and form feed respectively.</li>
<li><code>\xHEX</code>, where <code>HEX</code> is the codepoint of character in hexadecimal, e.g. <code>\x61</code> is the same as <code>a</code>.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org129f660" class="outline-3">
<h3 id="org129f660"><span class="section-number-3">1.4.</span> Characters</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Two kinds of syntax for character literals:
</p>

<ul class="org-ul">
<li><code>#\NAME</code> where <code>NAME</code> is the name for the character. <code>NAME</code> is often the character itself (e.g. <code>#\a</code> refers to the character <code>a</code>), but exceptions exist; see below.</li>
<li><code>#ch{HEX}</code> where <code>HEX</code> is the codepoint in hexadecimal, e.g. <code>#ch{61}</code> is the same as <code>#\a</code>.</li>
</ul>

<p>
As for the first kind, Scheme R4RS only explicitly declares a <code>#\space</code> and a <code>#\newline</code>. Stargaze (partly) follows <a href="https://groups.csail.mit.edu/mac/ftpdir/scheme-7.4/doc-html/scheme_6.html">the convention in MIT Scheme</a>, except that <code>#\newline</code> always corresponds to the ASCII LF regardless of the operating system. For this reason the following "character name"s are also defined in Stargaze:
</p>

<ul class="org-ul">
<li><p>
All of the standard ASCII names for non-printing characters are supported. They can be used by prefixing with <code>#\</code>, e.g. <code>#\NUL</code>:
</p>
<pre class="example">
NUL     SOH     STX     ETX     EOT     ENQ     ACK     BEL
BS      HT      LF      VT      FF      CR      SO      SI
DLE     DC1     DC2     DC3     DC4     NAK     SYN     ETB
CAN     EM      SUB     ESC     FS      GS      RS      US
DEL
</pre></li>
<li>A few other names are also defined:
<ul class="org-ul">
<li><code>#\esc</code>, for <code>#\ESC</code>. MIT Scheme used the string <code>#\altmode</code>, which we</li>
<li><code>#\backspace</code> for <code>#\BS</code></li>
<li><code>#\linefeed</code> for <code>#\LF</code> (also, as stated above, <code>#\newline</code>)</li>
<li><code>#\tab</code> for <code>#\HT</code></li>
<li><code>#\return</code> for <code>#\CR</code></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9073797" class="outline-3">
<h3 id="org9073797"><span class="section-number-3">1.5.</span> Vector</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Vector literals can be constructed by surrounding values with <code>#{</code> and <code>}</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-org399c19e" class="outline-2">
<h2 id="org399c19e"><span class="section-number-2">2.</span> Built-in primitives</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><code>(def NAME BODY)</code>: Bind the value <code>BODY</code> to the name <code>NAME</code> in the current environment.</li>
<li><code>(fn ARGLIST BODY)</code>: Anonymous function.</li>
<li><code>(if COND THEN_CLAUSE ELSE_CLAUSE)</code>: Simple branching.</li>
<li><code>(cond (COND1 CLAUSE1) ...)</code>: Multiway branching.</li>
<li><code>(let ((NAME1 EXP1) ...) BODY ...)</code>: <code>let</code>-binding.</li>
<li><code>(letrec ((NAME1 EXP1) ...) BODY ...)</code>: <code>letrec</code>-binding.</li>
<li><code>(quote ...)</code>: Quote its argument as symbolic values</li>
<li><code>(set! NAME VALUE)</code>: Assign <code>VALUE</code> to the name <code>NAME</code>.</li>
<li><code>(begin EXP1 ...)</code>: Executes <code>EXP1</code> and the rest in the order they appear in the argument list. Returns the evaluated value of the last argument..</li>
</ul>
</div>

<div id="outline-container-org7995371" class="outline-3">
<h3 id="org7995371"><span class="section-number-3">2.1.</span> Module-related</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><code>(include STR)</code>: Include a file.</li>
<li><code>(import MOD RENAME?)</code>:
<ul class="org-ul">
<li><code>MOD</code> can be one of two options:
<ul class="org-ul">
<li>A string, which refers to the module.</li>
<li><code>(STR PREFIX)</code>, which prefix all exported name in <code>STR</code> with <code>PREFIX</code>.
<ul class="org-ul">
<li>e.g. assumes that <code>mymodule</code> exports <code>func1</code>, <code>func2</code> and <code>func3</code>; <code>(import ("mymodule" xyz))</code> would import <code>func1</code> as <code>xyzfunc1</code>, <code>func2</code> as <code>xyzfunc2</code>, <code>func3</code> as <code>xyzfunc3</code>.</li>
</ul></li>
</ul></li>
<li><code>RENAME</code> is one of two followings:
<ul class="org-ul">
<li>Nothing, in which case the form would be <code>(import MOD)</code>; this would import <b>all</b> exported name in <code>MOD</code>.</li>
<li>A list of <code>(NAME NEWNAME)</code>, which would only import the <b>exported</b> names described by <code>NAME</code>, which would bind to <code>NEWNAME</code> when importing. This renaming takes precedence over prefixes, so <code>(import ("abc" abc) (myfunc1 defmyfunc1))</code> would import <code>myfunc1</code> from module <code>"abc"</code> into <code>defmyfunc1</code> instead of <code>abcmyfunc1</code> or <code>abcdefmyfunc1</code>.</li>
</ul></li>
<li>Note that <code>(import MOD)</code> means import <b>all</b> names from <code>MOD</code>, while <code>(import MOD ())</code> means import all the exported names in <code>()</code>, which means none of the exported names.</li>
</ul></li>
</ul>
<p>
in the imported module; <code>NEW_NAME</code> would be the effective name in the <b>importing</b> module for <code>NAME</code> in the <b>imported</b> module.
</p>
<ul class="org-ul">
<li><code>(export NAME ...)</code>: Export</li>
</ul>
</div>
</div>

<div id="outline-container-orgd11db39" class="outline-3">
<h3 id="orgd11db39"><span class="section-number-3">2.2.</span> Miscellaneous</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><code>(atom? EXP)</code>: Check if <code>EXP</code> is an atom, i.e. a symbol, an integer, a boolean, a string, a character, or the empty list.</li>
</ul>
</div>
</div>

<div id="outline-container-org5d5e166" class="outline-3">
<h3 id="org5d5e166"><span class="section-number-3">2.3.</span> Integer</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><code>(int? EXP)</code>: Check if <code>EXP</code> is an integer.</li>
<li><code>(add EXP ...)</code>: Return the sum of the arguments.</li>
<li><code>(sub EXP1 ...)</code>: Return <code>EXP1 - EXP2 - ...</code>.</li>
<li><code>(mul EXP ...)</code>: Return the product of the arguments.</li>
<li><code>(div EXP1 ...)</code>: Return <code>EXP1 div EXP2 div ...</code></li>
<li><code>(mod EXP1 EXP2)</code>: Return <code>EXP1 % EXP2</code>.</li>
<li><code>(leq EXP1 EXP2)</code>, <code>(lt EXP1 EXP2)</code>, <code>(geq EXP1 EXP2)</code>, <code>(gt EXP1 EXP2)</code>: Check if <code>EXP1</code> is smaller or equal than, strictly smaller than, greater or equal than, and strictly greater than <code>EXP2</code> respectively.</li>
</ul>
</div>
</div>

<div id="outline-container-org4021774" class="outline-3">
<h3 id="org4021774"><span class="section-number-3">2.4.</span> Floating-point</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li><code>(float? EXP)</code>: Check if <code>EXP</code> is an integer.</li>
<li><code>(addf EXP ...)</code>: Return the sum of the arguments.</li>
<li><code>(subf EXP1 ...)</code>: Return <code>EXP1 - EXP2 - ...</code>.</li>
<li><code>(mulf EXP ...)</code>: Return the product of the arguments.</li>
<li><code>(divf EXP1 ...)</code>: Return <code>EXP1 div EXP2 div ...</code></li>
<li><code>(float INT)</code>: Convert <code>INT</code> to a floating point number.
<ul class="org-ul">
<li>Returns the argument itself if it is already a floating-point number.</li>
</ul></li>
<li><code>(floor FLOAT)</code>, <code>(ceil FLOAT)</code>, <code>(round FLOAT)</code>, <code>(trunc FLOAT)</code>:
<ul class="org-ul">
<li><code>floor</code> returns the first integer that's smaller than or equal to its arugment.</li>
<li><code>ceil</code> returns the first integer that's bigger than or equal to its argument.</li>
<li><code>round</code> rounds its argument to the nearest integer.</li>
<li><code>trunc</code> directly removes the decimal part.</li>
<li>Returns the argument itself if it is already an integer.</li>
</ul></li>
<li><code>(leqf EXP1 EXP2)</code>, <code>(ltf EXP1 EXP2)</code>, <code>(geqf EXP1 EXP2)</code>, <code>(gtf EXP1 EXP2)</code>: Check if <code>EXP1</code> is smaller or equal than, strictly smaller than, greater or equal than, and strictly greater than <code>EXP2</code> respectively.</li>

<li><code>(eqnum EXP1 EXP2)</code>: Return if <code>EXP1</code> and <code>EXP2</code> has the same numerical value.</li>
</ul>
</div>
</div>

<div id="outline-container-org83faf2b" class="outline-3">
<h3 id="org83faf2b"><span class="section-number-3">2.5.</span> Pair</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li><code>(cons EXP1 EXP2)</code>: Return the pair of <code>EXP1</code> and <code>EXP2</code></li>
<li><code>(car EXP1)</code>: Return the first component of the pair <code>EXP1</code>.</li>
<li><code>(cdr EXP1)</code>: Return the second component of the pair <code>EXP2</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-orge3530bf" class="outline-3">
<h3 id="orge3530bf"><span class="section-number-3">2.6.</span> Character</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li><code>(chr INT)</code>: Convert <code>INT</code> into the corresponding character.</li>
<li><code>(ord CHAR)</code>: Convert <code>CHAR</code> into the corresponding integer.</li>
<li><code>(char? EXP)</code>: Check if <code>EXP</code> is a character.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc4fe870" class="outline-3">
<h3 id="orgc4fe870"><span class="section-number-3">2.7.</span> String</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li><code>(strref STR I)</code>: Retrieve the <code>I</code>-th (starting from 0) character of the string <code>STR</code>.</li>
<li><code>(substr STR START END?)</code>: Retrieve the substring of the string <code>STR</code> starting from index <code>START</code> to index <code>END</code>. <code>END</code> is optional; if it's not provided, this function takes the substring starting from index <code>START</code> to the end of the string.</li>
<li><code>(strappend STR1 ...)</code>: Return the string appended together from its arguments.</li>
<li><code>(strsym STR)</code>: Convert a string to a symbol.</li>
<li><code>(str? EXP)</code>: Check if <code>EXP</code> is a string.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc05c8ad" class="outline-3">
<h3 id="orgc05c8ad"><span class="section-number-3">2.8.</span> Boolean</h3>
<div class="outline-text-3" id="text-2-8">
<ul class="org-ul">
<li><code>(and EXP1 ...)</code>:</li>
<li><code>(or EXP1 ...)</code>:</li>
<li><code>(not EXP)</code>:</li>
</ul>
</div>
</div>

<div id="outline-container-org94f8f77" class="outline-3">
<h3 id="org94f8f77"><span class="section-number-3">2.9.</span> Symbol</h3>
<div class="outline-text-3" id="text-2-9">
<ul class="org-ul">
<li><code>(symstr SYM)</code>: Convert a symbol to a string.</li>
<li><code>(sym? EXP)</code>: Check if <code>EXP</code> is a symbol.</li>
</ul>
</div>
</div>

<div id="outline-container-org1bd9999" class="outline-3">
<h3 id="org1bd9999"><span class="section-number-3">2.10.</span> List</h3>
<div class="outline-text-3" id="text-2-10">
<ul class="org-ul">
<li><code>(list EXP1 ...)</code>: Combine its arguments into a list.</li>
<li><code>(nil? EXP)</code>: Check if <code>EXP</code> is an empty list.</li>
</ul>
</div>
</div>

<div id="outline-container-org8e56296" class="outline-3">
<h3 id="org8e56296"><span class="section-number-3">2.11.</span> Vector</h3>
<div class="outline-text-3" id="text-2-11">
<ul class="org-ul">
<li><code>(vec? EXP)</code>: Check if <code>EXP</code> is a vector.</li>
<li><code>(vector EXP1 ...)</code>: Combine its arguments into a vector.</li>
<li><code>(listvec LIST)</code>: Convert <code>LIST</code> into a vector.</li>
<li><code>(veclist VEC)</code>: Conver <code>VEC</code> into a list</li>
<li><code>(vecref VEC INT)</code>: Return the <code>INT</code>-th element from <code>VEC</code>.</li>
<li><code>(mkvec INT)</code>: Create a vector of size <code>INT</code>.</li>
<li><code>(vecset! VEC INT VALUE)</code>: Set the <code>INT</code>-th element of <code>VEC</code> to value <code>VALUE</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-orga53516a" class="outline-3">
<h3 id="orga53516a"><span class="section-number-3">2.12.</span> File input/output</h3>
<div class="outline-text-3" id="text-2-12">
<ul class="org-ul">
<li><code>stdin</code>, <code>stdout</code>, <code>stderr</code>: Standard input, standard output and standard error.</li>
<li><code>(eof? EXP)</code>: Check if <code>EXP</code> is the EOF object.</li>
<li><code>(openinput STR)</code>: Open file <code>STR</code> as input.</li>
<li><code>(openoutput STR MODE?)</code>: Open file <code>STR</code> as output.
<ul class="org-ul">
<li>When <code>MODE</code> is not used (i.e. the form is <code>(openoutput STR)</code>), the file is opened for writing.</li>
<li>When <code>MODE</code> is <code>"a"</code>, the file is opened for appending.</li>
</ul></li>
<li><code>(close FILE)</code>: Close a file.</li>
<li><code>(readch FILE)</code>: Read a character from an input file.</li>
<li><code>(writech FILE)</code>: Write a character to an output file.</li>
</ul>
</div>
</div>

<div id="outline-container-org1704f30" class="outline-3">
<h3 id="org1704f30"><span class="section-number-3">2.13.</span> Iteration</h3>
<div class="outline-text-3" id="text-2-13">
<p>
Iteration is important (at least for now) since we don't have tail-call optimization.
</p>

<ul class="org-ul">
<li><code>(while COND BODY)</code>: Repeatedly execute <code>BODY</code> until <code>COND</code> evaluates to false. Returns nil.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6e92d60" class="outline-2">
<h2 id="org6e92d60"><span class="section-number-2">3.</span> Extended primitives</h2>
<div class="outline-text-2" id="text-3">
<p>
A few functions that should be able to be defined using the language itself is defined as primitives for performance, even if there aren't much performance to begin with&#x2026;
</p>
</div>

<div id="outline-container-org53b2ec8" class="outline-3">
<h3 id="org53b2ec8"><span class="section-number-3">3.1.</span> List libraries</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><code>(length LIST)</code>: Return the length of <code>LIST</code>.</li>
<li><code>(append EXP ...)</code> / <code>(list++ EXP ...)</code>: Combines <code>EXP</code> and the rest into one list.</li>
<li><code>(reverse LIST)</code>: Return a reversed version of <code>LIST</code>.</li>
<li><code>map</code>:</li>
<li><code>filter</code>:</li>
<li><code>member</code>:</li>
<li><code>assoc</code>:</li>
<li><code>set-car!</code>:</li>
<li><code>set-cdr!</code>:</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-08-22 Thu 15:25</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
